Revit 2026 API

# ValueAtPoint(IListDouble) Constructor

---

Initializes a new instance of the ValueAtPoint class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ValueAtPoint(
	IList<double> values
)
```
```vb
Public Sub New (
	values As IList(Of Double)
)
```
```cpp
public:
ValueAtPoint(
	IList<double>^ values
)
```
```fsharp
new :
        values : IList<float> -> ValueAtPoint
```

#### Parameters

values IListDouble

#### Reference

ValueAtPoint Class

ValueAtPoint Overload

Autodesk.Revit.DB.Analysis Namespace